import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-staff',
  templateUrl: './staff.component.html',
  styleUrls: ['./staff.component.css']
})
export class StaffComponent implements OnInit {

  constructor() { }

  ngOnInit(): void {
  }

  staff = [
    {
      name: 'سلمى اللبابيدي',
      address: ' العنوان: رياق',
      avatar: '../../../assets/images/salma.jpg',
      degree: '',
      info: `
        مديرة مدرسة ومعهد القيروان،
        والمسؤولة الأولى والأخيرة عن الأساتذة والطلاب فيهما.
        تملك الكثير من سنوات الخبرة في المجال الاداري والتعليمي.`
    },
    {
      name: 'حمزة شمص',
      address: 'العنوان: اللبوة',
      avatar: '../../../assets/images/hamze.png',
      degree: ` الشهادة: إجازة في العلوم السياسية والادارية، دبلوم علاقات دولية ودبلوماسية، وماجيستر في القانون الدولي العام`,
      info: `بدأ العمل في المعهد في بداية العام الدراسي 2017-2018
        يقوم بتدريس مواد العلوم الاجتماعية، الثقافة، الادارة، القانون والاقتصاد وغيرها
        هذه المواد تدخل ضمن المنهاج الرسمي لصفوف المحاسبة والمعلوماتية، العناية التمريضية والتربية الحضانية بمختلف المستويات.
      `
    },
    {
      name: ' زينب نزها',
      address: ' العنوان:  النبي عثمان',
      avatar: '../../../assets/images/zeinab-n.jpg',
      degree: ' الشهادة: إجازة في الادارة والتسويق.',
      info: ` بدأت العمل في المعهد في بداية العام الدراسي 2016-2017
        تقوم بتدريس عدد من المواد منها الادارة الاتجارية، الاتصال والتنظيم، الاتصال المهني والمحاسبة التحليلية.
        هذه المواد تدخل ضمن المنهاج الرسمي لصف المحاسبة والمعلوماتية بمختلف المستويات، وصف الادارة والتسويق شهادة الامتياز الفني.
      `
    },
    {
      name: ' زينة ناصر الدين',
      address: 'العنوان: العين',
      avatar: '../../../assets/images/zeina.jpg',
      degree: 'الشهادة:  إجازة في العلوم التربوية، وتتابع تحصيل إجازة في علم النفس.',
      info: `بدأت العمل في المعهد في بداية العام الدراسي 2016-2017
        تقوم بتدريس عدد من المواد منها أدب أطفال، أدب الشباب، تاريخ التيارات التربوية، فنون وموسيقى، تربية حركية، وبحوث.
        هذه المواد تدخل ضمن المنهاج الرسمي لصفوف التربية الحضانية بمختلف المستويات.
      `
    },
    {
      name: ' فراس العرب',
      address: ' العنوان: شعت',
      avatar: '../../../assets/images/firas.jpg',
      degree: ' الشهادة: اجازة في العناية التمريضية',
      info: `بدأ العمل في المعهد في بداية العام الدراسي 2017-2018
        وهو يملك العديد من سنوات الخبرة في المجال التعليمي، بالإضافة الى عمله كجرّاح في المستشفى الحكومي(الهرمل) لأكثر من 10 سنوات.
        ومؤخراً بدأ بإدارة قسم الكورونا في المستشفى.
        ويقوم بتدريس عدد من المواد علم الصحة، عناية طبية وجراحية، العناية بالأم والطفل، علم الأدوية، تشريح، مصلحات طبية ..
      `
    },
    {
      name: ' سمر ناصر الدين',
      address: ' العنوان: العين',
      avatar: '../../../assets/images/samar.jpg',
      degree: ' الشهادة: إجازة في العلوم التربوية.',
      info: `بدأت العمل في المعهد في بداية العام الدراسي 2016-2017
        تقوم بتدريس عدد من المواد منها رياضيات في مرحلة الروضة، ملف الطفل، علم التربية وتدريب.
        هذه المواد تدخل ضمن المنهاج الرسمي لصفوف التربية الحضانية.
      `
    },
    {
      name: 'أحمد عزالدين',
      address: 'العنوان: عرسال',
      avatar: '../../../assets/images/ahmed.jpg',
      degree: `الشهادة: امتياز فني المراجعة والخبرة في المحاسبة، إجازة في اللغة
              العربية `,
      info: `بدأ العمل في المعهد في بداية العام الدراسي 2017-2018
          ويقوم بتدريس عدد من المواد منها المحاسبة، الرياضيات المالية واللغة العربية لكافة الاختصاصات.
        `
    },
    {
      name: 'سراب المصري',
      address: ' العنوان: الفاكهة',
      avatar: '../../../assets/images/sarab.jpg',
      degree: ' الشهادة: إجازة في اللغة الانكليزية وآدابها.',
      info: `تملك العديد من سنوات الخبرة في المجال التعليمي.
        تقوم بتدريس اللغة الانكليزية لمختلف الاختصاصات والمستويات: المحاسبة والمعلوماتية، العناية التمريضية والتربية الحضانية.
      `
    },
    {
      name: ' زينب حوري',
      address: 'العنوان: جديدة الفاكهة',
      avatar: '../../../assets/images/zeinab-h.jpg',
      degree: 'الشهادة: إجازة في العناية التمريضية.  ',
      info: `بدأت العمل في المعهد في بداية العام الدراسي 2018-2019
        تقوم بتدريس عدد من المواد منها تشريح، عناية صحية، مصطلحات طبية وتدريب.
      `
    },
    {
      name: ' ندى غصن',
      address: ' العنوان: الهرمل',
      avatar: '../../../assets/images/nada.jpg',
      degree: ' الشهادة: إجازة في العناية التمريضية.',
      info: `بدأت العمل في المعهد في بداية العام الدراسي 2016-2017
        وهي المشرفة على التدريب في المستشفى لصفوف العناية التمريضية
      `
    },
    {
      name: ' قاسم ناصرالدين',
      address: ' العنوان: العين',
      avatar: '../../../assets/images/kassem.jpg',
      degree: ' الشهادة إجازة في برمجة الكمبيوتر.',
      info: `بدأ العمل في المعهد في بداية العام الدراسي 2015-2016
        يقوم بتدريس عدد من المواد منها
        Java, web, database, Microsoft Office ...
        هذه المواد تدخل ضمن المنهاج الرسمي لصفوف المحاسبة والمعلوماتية مستوى البكالوريا الفنية، وصف المعلوماتية الادارية مستوى الامتياز الفني.
      `
    },
  ]

  showInfo(e) {
    const info = e.target.nextElementSibling;
    info.style.display ='block'
    e.target.style.display ='none'
  }

}
